//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

/=#
#include "VFR.uni"


#string STR_AMI_PSP_FTPM_FORM           #language eng "AMD fTPM configuration"
#string STR_AMI_PSP_FTPM_HELP           #language eng "AMD fTPM Settings"

#string STR_FTPM_SWITCH                 #language eng "AMD fTPM switch"
                                        #language x-AMI "PSP001"
#string STR_FTPM_SWITCH_HELP            #language eng "To select.0:AMD CPU fTPM. 1:AMD CPU fTPM Disabled."

#string STR_FTPM_DISABLED               #language eng "AMD CPU fTPM Disabled"
#string STR_TPM_AMDFTPM                 #language eng "AMD CPU fTPM"

#string STR_PSP_ERASE_FTPM_NV           #language eng "Erase fTPM NV for factory reset"
                                        #language x-AMI "PSP002"
#string STR_ERASE_FTPM_NV_HELP          #language eng "When New CPU is installed, Select \"Enabled\" to reset fTPM, if you have BitLocker or encryption-enabled system, the system will not boot without a recovery key. Select \"Disabled\" to keep previous fTPM record and continue system boot, fTPM will NOT be enabled with new CPU unless fTPM is reset (reinitialized), you could swap back to the old CPU to recover TPM related keys and data." 

#string STR_PSP_FTPM_DISABLED           #language eng "Disabled"
#string STR_PSP_FTPM_ENABLED            #language eng "Enabled"

//----------------------------------------------------------------------------
//                 FIRMWIRE VERSION
//----------------------------------------------------------------------------
//#string STR_PSP_FWVERSION_FORM              #language eng   "PSP Firmware Version"
//#string STR_PSP_FWVERSION_FORM_HELP         #language eng   "PSP Firmware Version Parameters"
//#string STR_PSP_FIXED_REGION                #language eng   "-------PSP Directory Level 1 Region-------"
//#string STR_PSP_UPDATABLE_REGION            #language eng   "-------PSP Directory Level 2 Region(Updatable)---"
//#string STR_PSP_BOT_VER_HELP                #language eng   "PSP BootLoader Version Parameters"
//#string STR_PSP_BOT_VER_STRING              #language eng   "PSP BootLoader Version"
//#string STR_PSP_BOT_VER_VALUE_L1            #language eng   "N/A"
//#string STR_PSP_BOT_VER_VALUE_L2            #language eng   "N/A"

//#string STR_PSP_SEC_OS_VER_HELP             #language eng   "PSP Secure OS Version Parameters"
//#string STR_PSP_SEC_OS_VER_STRING           #language eng   "PSP Secure OS Version"
//#string STR_PSP_SEC_OS_VER_VALUE            #language eng   "N/A"

//#string STR_SMU_FW_VER_HELP                 #language eng   "SMU FW Version Parameters"
//#string STR_SMU_FW_VER_STRING               #language eng   "SMU FW Version"
//#string STR_SMU_FW_VER_VALUE_L2             #language eng   "N/A"
//#string STR_SMU_FW_VER_VALUE_L1             #language eng   "N/A"
//#string STR_SMU_FW_VER_VALUE                #language eng   "N/A"

//#string STR_ABL_VER_HELP                    #language eng   "ABL Version Parameters"
//#string STR_ABL_VER_STRING                  #language eng   "ABL Version"
//#string STR_ABL_VER_VALUE_L2                #language eng   "N/A"
//#string STR_ABL_VER_VALUE_L1                #language eng   "N/A"

//#string STR_APCB_VER_HELP                   #language eng   "APCB Version Parameters"
//#string STR_APCB_VER_STRING                 #language eng   "APCB Version"
//#string STR_APCB_VER_VALUE_L2               #language eng   "N/A"
//#string STR_APCB_VER_VALUE_L1               #language eng   "N/A"

//#string STR_APOB_VER_HELP                   #language eng   "APOB Version Parameters"
//#string STR_APOB_VER_STRING                 #language eng   "APOB Version"
//#string STR_APOB_VER_VALUE_L2               #language eng   "N/A"
//#string STR_APOB_VER_VALUE_L1               #language eng   "N/A"

//#string STR_APPB_VER_HELP                   #language eng   "APPB Version Parameters"
//#string STR_APPB_VER_STRING                 #language eng   "APPB Version"
//#string STR_APPB_VER_VALUE_L2               #language eng   "N/A"
//#string STR_APPB_VER_VALUE_L1               #language eng   "N/A"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
